Revit 2027 API
PrintManager.Apply Method
 Apply the local print settings to global for all documents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Apply()
Public Sub Apply
public:
void Apply()
member Apply : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others.
Remarks
 This method will change the settings for the current printer to match what is set in the Print Manager. When the user attempts to print with this printer in the future, the changes made by the API session will be visible.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace